IDEA StatiCa Open Model
Hanging.UpperLength Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Length of upper part of hanging
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double UpperLength { get; set; }
Public Property UpperLength As Double
	Get
	Set
public:
property double UpperLength {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
Hanging Class
IdeaRS.OpenModel.Detail Namespace